"""
全局常量
"""

#################################################################################
# MYAPS常量、枚举
#################################################################################
NONE_AND_EMPTY = {None, ""}


YES_NO = {
    'Y': '是',
    'N': '否',
}

LOT_SIZE = {
    "EX": "一对一",
    "FX": "固定批",
    "VB": "重订货点",
    "D1": "按1天合并",
    "D2": "按2天合并",
    "D3": "按3天合并",
    "D4": "按4天合并",
    "D5": "按5天合并",
    "D6": "按6天合并",
    "W1": "按1周合并",
    "W2": "按2周合并",
    "W3": "按3周合并",
    "W4": "按4周合并",
    "M1": "按1月合并",
    "M2": "按2月合并",
    "M3": "按3月合并",
}

PRODUCT_CATEGORY = {
    'MTO': 'MTO',
    'MTS': 'MTS',
}

SUPPLY_TYPE = {
    'PL': '计划单',
    'MO': '生产工单',
    'PR': '采购申请',
    'PO': '采购订单',
    'ST': '库存',
}

DEMAND_TYPE = {
    "SO": "销售订单",
    "DM": "计划需求",
    "RS": "工单预留",
    "FC": "预测",
    "SS": "安全库存",
}

# 单据状态
ORDER_STATUS = {
    'NEW': '新建',
    'CRE': '未排',
    'SCH': '已排',
    'REL': '释放',
    'CNF': '报工',
    'CMP': '已完成',
}

