"""
XXXX的连接器
"""

import os, logging, requests


from . import ScheduleTasksAbc, MyapsDbActionsAbc, DefaultValueTplt, this_session
from apps.data_opt.utils.common import add_basic_auth_requests

#################################################################################
# ⬇️项目常量
#################################################################################
class DefaultValue(DefaultValueTplt):
    
    MAT_PLANT = "..."   # 默认工厂
    MAT_PLANNER = "..."   # 默认计划员
    MAT_LOCATION = "..."  # 默认车间
    

#################################################################################
# ⬇️模块变量及对象
#################################################################################


logging.basicConfig(level=logging.INFO, format='%(asctime)s - %(name)s - %(levelname)s - %(message)s')
logger = logging.getLogger(__name__)
...

#################################################################################
# ⬇️本文件内可复用的逻辑
#################################################################################
...



#################################################################################
# ⬇️定时任务设置
#################################################################################
class ScheduleTasks(ScheduleTasksAbc):
    pass

    



#################################################################################
# ⬇️数据库事件处理
#################################################################################
class MyapsDbActions(MyapsDbActionsAbc):
    pass